## CREATING A DATAFRAME USING A LIST

In [1]:
import pandas as pd

In [2]:
list_example=[10,20,30,40,50]

In [3]:
list_example

[10, 20, 30, 40, 50]

In [4]:
pd.DataFrame(data=list_example,columns=['values'],dtype="float")

   values
0    10.0
1    20.0
2    30.0
3    40.0
4    50.0

## CREATING A DATAFRAME USING NUMPY

In [5]:
import numpy as np

In [6]:
array_example=np.random.randint(0,50,(4,4)) #generating random numbers with 4 rows and 4 columns

In [7]:
array_example

array([[34, 29, 11, 31],
       [20, 34, 35,  2],
       [27, 49, 14, 17],
       [13, 48, 20, 10]], dtype=int32)

In [8]:
df=pd.DataFrame(data=array_example,index=["a","b","c","d"],columns=["val1","val2","val3","val4"])

In [9]:
df

   val1  val2  val3  val4
a    34    29    11    31
b    20    34    35     2
c    27    49    14    17
d    13    48    20    10

## CREATING A DATAFRAME USING A DICTIONARY

In [10]:
x=np.random.randint(0,50,size=6)

In [11]:
a=np.random.randint(0,50,size=6)
b=np.random.randint(0,50,size=6)
c=np.random.randint(0,50,size=6)

In [12]:
dict={"val1":x,"val2":a,"val3":b,"val4":c}

In [13]:
dict

{'val1': array([49, 34, 48, 27, 39, 19], dtype=int32),
 'val2': array([10, 23,  6, 47, 12, 38], dtype=int32),
 'val3': array([49, 10, 37, 43,  9, 40], dtype=int32),
 'val4': array([44, 18, 24, 36, 22, 24], dtype=int32)}

In [14]:
df=pd.DataFrame(dict)

In [15]:
df

   val1  val2  val3  val4
0    49    10    49    44
1    34    23    10    18
2    48     6    37    24
3    27    47    43    36
4    39    12     9    22
5    19    38    40    24